dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/common/deprecated/inc/hw_adc.h
//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOCOVF1 register
//
//*****************************************************************************
#define ADC_SOCOVF1_SOC0          0x1         // SOC0 Start of Conversion
                                              // Overflow Flag
#define ADC_SOCOVF1_SOC1          0x2         // SOC1 Start of Conversion
                                              // Overflow Flag
#define ADC_SOCOVF1_SOC2          0x4         // SOC2 Start of Conversion
                                              // Overflow Flag
#define ADC_SOCOVF1_SOC3          0x8         // SOC3 Start of Conversion
                                              // Overflow Flag
#define ADC_SOCOVF1_SOC4          0x10        // SOC4 Start of Conversion
                                              // Overflow Flag
#define ADC_SOCOVF1_SOC5          0x20        // SOC5 Start of Conversion
                                              // Overflow Flag
#define ADC_SOCOVF1_SOC6          0x40        // SOC6 Start of Conversion
                                              // Overflow Flag
#define ADC_SOCOVF1_SOC7          0x80        // SOC7 Start of Conversion
                                              // Overflow Flag
#define ADC_SOCOVF1_SOC8          0x100       // SOC8 Start of Conversion
                                              // Overflow Flag
#define ADC_SOCOVF1_SOC9          0x200       // SOC9 Start of Conversion
                                              // Overflow Flag
#define ADC_SOCOVF1_SOC10         0x400       // SOC10 Start of Conversion
                                              // Overflow Flag
#define ADC_SOCOVF1_SOC11         0x800       // SOC11 Start of Conversion
                                              // Overflow Flag
#define ADC_SOCOVF1_SOC12         0x1000      // SOC12 Start of Conversion
                                              // Overflow Flag
#define ADC_SOCOVF1_SOC13         0x2000      // SOC13 Start of Conversion
                                              // Overflow Flag
#define ADC_SOCOVF1_SOC14         0x4000      // SOC14 Start of Conversion
                                              // Overflow Flag
#define ADC_SOCOVF1_SOC15         0x8000      // SOC15 Start of Conversion
                                              // Overflow Flag

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOCOVFCLR1 register
//
//*****************************************************************************
#define ADC_SOCOVFCLR1_SOC0       0x1         // SOC0 Clear Start of Conversion
                                              // Overflow Bit
#define ADC_SOCOVFCLR1_SOC1       0x2         // SOC1 Clear Start of Conversion
                                              // Overflow Bit
#define ADC_SOCOVFCLR1_SOC2       0x4         // SOC2 Clear Start of Conversion
                                              // Overflow Bit
#define ADC_SOCOVFCLR1_SOC3       0x8         // SOC3 Clear Start of Conversion
                                              // Overflow Bit
#define ADC_SOCOVFCLR1_SOC4       0x10        // SOC4 Clear Start of Conversion
                                              // Overflow Bit
#define ADC_SOCOVFCLR1_SOC5       0x20        // SOC5 Clear Start of Conversion
                                              // Overflow Bit
#define ADC_SOCOVFCLR1_SOC6       0x40        // SOC6 Clear Start of Conversion
                                              // Overflow Bit
#define ADC_SOCOVFCLR1_SOC7       0x80        // SOC7 Clear Start of Conversion
                                              // Overflow Bit
#define ADC_SOCOVFCLR1_SOC8       0x100       // SOC8 Clear Start of Conversion
                                              // Overflow Bit
#define ADC_SOCOVFCLR1_SOC9       0x200       // SOC9 Clear Start of Conversion
                                              // Overflow Bit
#define ADC_SOCOVFCLR1_SOC10      0x400       // SOC10 Clear Start of Conversion
                                              // Overflow Bit
#define ADC_SOCOVFCLR1_SOC11      0x800       // SOC11 Clear Start of Conversion
                                              // Overflow Bit
#define ADC_SOCOVFCLR1_SOC12      0x1000      // SOC12 Clear Start of Conversion
                                              // Overflow Bit
#define ADC_SOCOVFCLR1_SOC13      0x2000      // SOC13 Clear Start of Conversion
                                              // Overflow Bit
#define ADC_SOCOVFCLR1_SOC14      0x4000      // SOC14 Clear Start of Conversion
                                              // Overflow Bit
#define ADC_SOCOVFCLR1_SOC15      0x8000      // SOC15 Clear Start of Conversion
                                              // Overflow Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC0CTL register
//
//*****************************************************************************
#define ADC_SOC0CTL_ACQPS_S       0
#define ADC_SOC0CTL_ACQPS_M       0x1FF       // SOC Acquisition Prescale
#define ADC_SOC0CTL_CHSEL_S       15
#define ADC_SOC0CTL_CHSEL_M       0x78000     // SOC Channel Select
#define ADC_SOC0CTL_TRIGSEL_S     20
#define ADC_SOC0CTL_TRIGSEL_M     0x1F00000   // SOC Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC1CTL register
//
//*****************************************************************************
#define ADC_SOC1CTL_ACQPS_S       0
#define ADC_SOC1CTL_ACQPS_M       0x1FF       // SOC Acquisition Prescale
#define ADC_SOC1CTL_CHSEL_S       15
#define ADC_SOC1CTL_CHSEL_M       0x78000     // SOC Channel Select
#define ADC_SOC1CTL_TRIGSEL_S     20
#define ADC_SOC1CTL_TRIGSEL_M     0x1F00000   // SOC Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC2CTL register
//
//*****************************************************************************
#define ADC_SOC2CTL_ACQPS_S       0
#define ADC_SOC2CTL_ACQPS_M       0x1FF       // SOC Acquisition Prescale
#define ADC_SOC2CTL_CHSEL_S       15
#define ADC_SOC2CTL_CHSEL_M       0x78000     // SOC Channel Select
#define ADC_SOC2CTL_TRIGSEL_S     20
#define ADC_SOC2CTL_TRIGSEL_M     0x1F00000   // SOC Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC3CTL register
//
//*****************************************************************************
#define ADC_SOC3CTL_ACQPS_S       0
#define ADC_SOC3CTL_ACQPS_M       0x1FF       // SOC Acquisition Prescale
#define ADC_SOC3CTL_CHSEL_S       15
#define ADC_SOC3CTL_CHSEL_M       0x78000     // SOC Channel Select
#define ADC_SOC3CTL_TRIGSEL_S     20
#define ADC_SOC3CTL_TRIGSEL_M     0x1F00000   // SOC Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC4CTL register
//
//*****************************************************************************
#define ADC_SOC4CTL_ACQPS_S       0
#define ADC_SOC4CTL_ACQPS_M       0x1FF       // SOC Acquisition Prescale
#define ADC_SOC4CTL_CHSEL_S       15
#define ADC_SOC4CTL_CHSEL_M       0x78000     // SOC Channel Select
#define ADC_SOC4CTL_TRIGSEL_S     20
#define ADC_SOC4CTL_TRIGSEL_M     0x1F00000   // SOC Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC5CTL register
//
//*****************************************************************************
#define ADC_SOC5CTL_ACQPS_S       0
#define ADC_SOC5CTL_ACQPS_M       0x1FF       // SOC Acquisition Prescale
#define ADC_SOC5CTL_CHSEL_S       15
#define ADC_SOC5CTL_CHSEL_M       0x78000     // SOC Channel Select
#define ADC_SOC5CTL_TRIGSEL_S     20
#define ADC_SOC5CTL_TRIGSEL_M     0x1F00000   // SOC Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC6CTL register
//
//*****************************************************************************
#define ADC_SOC6CTL_ACQPS_S       0
#define ADC_SOC6CTL_ACQPS_M       0x1FF       // SOC Acquisition Prescale
#define ADC_SOC6CTL_CHSEL_S       15
#define ADC_SOC6CTL_CHSEL_M       0x78000     // SOC Channel Select
#define ADC_SOC6CTL_TRIGSEL_S     20
#define ADC_SOC6CTL_TRIGSEL_M     0x1F00000   // SOC Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC7CTL register
//
//*****************************************************************************
#define ADC_SOC7CTL_ACQPS_S       0
#define ADC_SOC7CTL_ACQPS_M       0x1FF       // SOC Acquisition Prescale
#define ADC_SOC7CTL_CHSEL_S       15
#define ADC_SOC7CTL_CHSEL_M       0x78000     // SOC Channel Select
#define ADC_SOC7CTL_TRIGSEL_S     20
#define ADC_SOC7CTL_TRIGSEL_M     0x1F00000   // SOC Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC8CTL register
//
//*****************************************************************************
#define ADC_SOC8CTL_ACQPS_S       0
#define ADC_SOC8CTL_ACQPS_M       0x1FF       // SOC Acquisition Prescale
#define ADC_SOC8CTL_CHSEL_S       15
#define ADC_SOC8CTL_CHSEL_M       0x78000     // SOC Channel Select
#define ADC_SOC8CTL_TRIGSEL_S     20
#define ADC_SOC8CTL_TRIGSEL_M     0x1F00000   // SOC Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC9CTL register
//
//*****************************************************************************
#define ADC_SOC9CTL_ACQPS_S       0
#define ADC_SOC9CTL_ACQPS_M       0x1FF       // SOC Acquisition Prescale
#define ADC_SOC9CTL_CHSEL_S       15
#define ADC_SOC9CTL_CHSEL_M       0x78000     // SOC Channel Select
#define ADC_SOC9CTL_TRIGSEL_S     20
#define ADC_SOC9CTL_TRIGSEL_M     0x1F00000   // SOC Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC10CTL register
//
//*****************************************************************************
#define ADC_SOC10CTL_ACQPS_S      0
#define ADC_SOC10CTL_ACQPS_M      0x1FF       // SOC Acquisition Prescale
#define ADC_SOC10CTL_CHSEL_S      15
#define ADC_SOC10CTL_CHSEL_M      0x78000     // SOC Channel Select
#define ADC_SOC10CTL_TRIGSEL_S    20
#define ADC_SOC10CTL_TRIGSEL_M    0x1F00000   // SOC Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC11CTL register
//
//*****************************************************************************
#define ADC_SOC11CTL_ACQPS_S      0
#define ADC_SOC11CTL_ACQPS_M      0x1FF       // SOC Acquisition Prescale
#define ADC_SOC11CTL_CHSEL_S      15
#define ADC_SOC11CTL_CHSEL_M      0x78000     // SOC Channel Select
#define ADC_SOC11CTL_TRIGSEL_S    20
#define ADC_SOC11CTL_TRIGSEL_M    0x1F00000   // SOC Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC12CTL register
//
//*****************************************************************************
#define ADC_SOC12CTL_ACQPS_S      0
#define ADC_SOC12CTL_ACQPS_M      0x1FF       // SOC Acquisition Prescale
#define ADC_SOC12CTL_CHSEL_S      15
#define ADC_SOC12CTL_CHSEL_M      0x78000     // SOC Channel Select
#define ADC_SOC12CTL_TRIGSEL_S    20
#define ADC_SOC12CTL_TRIGSEL_M    0x1F00000   // SOC Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC13CTL register
//
//*****************************************************************************
#define ADC_SOC13CTL_ACQPS_S      0
#define ADC_SOC13CTL_ACQPS_M      0x1FF       // SOC Acquisition Prescale
#define ADC_SOC13CTL_CHSEL_S      15
#define ADC_SOC13CTL_CHSEL_M      0x78000     // SOC Channel Select
#define ADC_SOC13CTL_TRIGSEL_S    20
#define ADC_SOC13CTL_TRIGSEL_M    0x1F00000   // SOC Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC14CTL register
//
//*****************************************************************************
#define ADC_SOC14CTL_ACQPS_S      0
#define ADC_SOC14CTL_ACQPS_M      0x1FF       // SOC Acquisition Prescale
#define ADC_SOC14CTL_CHSEL_S      15
#define ADC_SOC14CTL_CHSEL_M      0x78000     // SOC Channel Select
#define ADC_SOC14CTL_TRIGSEL_S    20
#define ADC_SOC14CTL_TRIGSEL_M    0x1F00000   // SOC Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCSOC15CTL register
//
//*****************************************************************************
#define ADC_SOC15CTL_ACQPS_S      0
#define ADC_SOC15CTL_ACQPS_M      0x1FF       // SOC Acquisition Prescale
#define ADC_SOC15CTL_CHSEL_S      15
#define ADC_SOC15CTL_CHSEL_M      0x78000     // SOC Channel Select
#define ADC_SOC15CTL_TRIGSEL_S    20
#define ADC_SOC15CTL_TRIGSEL_M    0x1F00000   // SOC Trigger Source Select

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCEVTSTAT register
//
//*****************************************************************************
#define ADC_EVTSTAT_PPB1TRIPHI    0x1         // Post Processing Block 1 Trip
                                              // High Flag
#define ADC_EVTSTAT_PPB1TRIPLO    0x2         // Post Processing Block 1 Trip
                                              // Low Flag
#define ADC_EVTSTAT_PPB1ZERO      0x4         // Post Processing Block 1 Zero
                                              // Crossing Flag
#define ADC_EVTSTAT_PPB2TRIPHI    0x10        // Post Processing Block 2 Trip
                                              // High Flag
#define ADC_EVTSTAT_PPB2TRIPLO    0x20        // Post Processing Block 2 Trip
                                              // Low Flag
#define ADC_EVTSTAT_PPB2ZERO      0x40        // Post Processing Block 2 Zero
                                              // Crossing Flag
#define ADC_EVTSTAT_PPB3TRIPHI    0x100       // Post Processing Block 3 Trip
                                              // High Flag
#define ADC_EVTSTAT_PPB3TRIPLO    0x200       // Post Processing Block 3 Trip
                                              // Low Flag
#define ADC_EVTSTAT_PPB3ZERO      0x400       // Post Processing Block 3 Zero
                                              // Crossing Flag
#define ADC_EVTSTAT_PPB4TRIPHI    0x1000      // Post Processing Block 4 Trip
                                              // High Flag
#define ADC_EVTSTAT_PPB4TRIPLO    0x2000      // Post Processing Block 4 Trip
                                              // Low Flag
#define ADC_EVTSTAT_PPB4ZERO      0x4000      // Post Processing Block 4 Zero
                                              // Crossing Flag

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCEVTCLR register
//
//*****************************************************************************
#define ADC_EVTCLR_PPB1TRIPHI     0x1         // Post Processing Block 1 Trip
                                              // High Clear
#define ADC_EVTCLR_PPB1TRIPLO     0x2         // Post Processing Block 1 Trip
                                              // Low Clear
#define ADC_EVTCLR_PPB1ZERO       0x4         // Post Processing Block 1 Zero
                                              // Crossing Clear
#define ADC_EVTCLR_PPB2TRIPHI     0x10        // Post Processing Block 2 Trip
                                              // High Clear
#define ADC_EVTCLR_PPB2TRIPLO     0x20        // Post Processing Block 2 Trip
                                              // Low Clear
#define ADC_EVTCLR_PPB2ZERO       0x40        // Post Processing Block 2 Zero
                                              // Crossing Clear
#define ADC_EVTCLR_PPB3TRIPHI     0x100       // Post Processing Block 3 Trip
                                              // High Clear
#define ADC_EVTCLR_PPB3TRIPLO     0x200       // Post Processing Block 3 Trip
                                              // Low Clear
#define ADC_EVTCLR_PPB3ZERO       0x400       // Post Processing Block 3 Zero
                                              // Crossing Clear
#define ADC_EVTCLR_PPB4TRIPHI     0x1000      // Post Processing Block 4 Trip
                                              // High Clear
#define ADC_EVTCLR_PPB4TRIPLO     0x2000      // Post Processing Block 4 Trip
                                              // Low Clear
#define ADC_EVTCLR_PPB4ZERO       0x4000      // Post Processing Block 4 Zero
                                              // Crossing Clear

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCEVTSEL register
//
//*****************************************************************************
#define ADC_EVTSEL_PPB1TRIPHI     0x1         // Post Processing Block 1 Trip
                                              // High Event Enable
#define ADC_EVTSEL_PPB1TRIPLO     0x2         // Post Processing Block 1 Trip
                                              // Low Event Enable
#define ADC_EVTSEL_PPB1ZERO       0x4         // Post Processing Block 1 Zero
                                              // Crossing Event Enable
#define ADC_EVTSEL_PPB2TRIPHI     0x10        // Post Processing Block 2 Trip
                                              // High Event Enable
#define ADC_EVTSEL_PPB2TRIPLO     0x20        // Post Processing Block 2 Trip
                                              // Low Event Enable
#define ADC_EVTSEL_PPB2ZERO       0x40        // Post Processing Block 2 Zero
                                              // Crossing Event Enable
#define ADC_EVTSEL_PPB3TRIPHI     0x100       // Post Processing Block 3 Trip
                                              // High Event Enable
#define ADC_EVTSEL_PPB3TRIPLO     0x200       // Post Processing Block 3 Trip
                                              // Low Event Enable
#define ADC_EVTSEL_PPB3ZERO       0x400       // Post Processing Block 3 Zero
                                              // Crossing Event Enable
#define ADC_EVTSEL_PPB4TRIPHI     0x1000      // Post Processing Block 4 Trip
                                              // High Event Enable
#define ADC_EVTSEL_PPB4TRIPLO     0x2000      // Post Processing Block 4 Trip
                                              // Low Event Enable
#define ADC_EVTSEL_PPB4ZERO       0x4000      // Post Processing Block 4 Zero
                                              // Crossing Event Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCEVTINTSEL register
//
//*****************************************************************************
#define ADC_EVTINTSEL_PPB1TRIPHI  0x1         // Post Processing Block 1 Trip
                                              // High Interrupt Enable
#define ADC_EVTINTSEL_PPB1TRIPLO  0x2         // Post Processing Block 1 Trip
                                              // Low Interrupt Enable
#define ADC_EVTINTSEL_PPB1ZERO    0x4         // Post Processing Block 1 Zero
                                              // Crossing Interrupt Enable
#define ADC_EVTINTSEL_PPB2TRIPHI  0x10        // Post Processing Block 2 Trip
                                              // High Interrupt Enable
#define ADC_EVTINTSEL_PPB2TRIPLO  0x20        // Post Processing Block 2 Trip
                                              // Low Interrupt Enable
#define ADC_EVTINTSEL_PPB2ZERO    0x40        // Post Processing Block 2 Zero
                                              // Crossing Interrupt Enable
#define ADC_EVTINTSEL_PPB3TRIPHI  0x100       // Post Processing Block 3 Trip
                                              // High Interrupt Enable
#define ADC_EVTINTSEL_PPB3TRIPLO  0x200       // Post Processing Block 3 Trip
                                              // Low Interrupt Enable
#define ADC_EVTINTSEL_PPB3ZERO    0x400       // Post Processing Block 3 Zero
                                              // Crossing Interrupt Enable
#define ADC_EVTINTSEL_PPB4TRIPHI  0x1000      // Post Processing Block 4 Trip
                                              // High Interrupt Enable
#define ADC_EVTINTSEL_PPB4TRIPLO  0x2000      // Post Processing Block 4 Trip
                                              // Low Interrupt Enable
#define ADC_EVTINTSEL_PPB4ZERO    0x4000      // Post Processing Block 4 Zero
                                              // Crossing Interrupt Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCCOUNTER register
//
//*****************************************************************************
#define ADC_COUNTER_FREECOUNT_S   0
#define ADC_COUNTER_FREECOUNT_M   0xFFF       // ADC Free Running Counter Value

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCREV register
//
//*****************************************************************************
#define ADC_REV_TYPE_S            0
#define ADC_REV_TYPE_M            0xFF        // ADC Type
#define ADC_REV_REV_S             8
#define ADC_REV_REV_M             0xFF00      // ADC Revision

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCOFFTRIM register
//
//*****************************************************************************
#define ADC_OFFTRIM_OFFTRIM_S     0
#define ADC_OFFTRIM_OFFTRIM_M     0xFF        // ADC Offset Trim

//*****************************************************************************
//
// The following are defines for the bit fields in the ADCPPB1CONFIG register
//
//*****************************************************************************
#define ADC_PPB1CONFIG_CONFIG_S   0
#define ADC_PPB1CONFIG_CONFIG_M   0xF         // ADC Post Processing Block
                                              // Configuration
#define ADC_PPB1CONFIG_TWOSCOMPEN  0x10        // ADC Post Processing Block Two's
                                              // Complement Enable

